var status = -1;
var selectionLog = [];
function start(g, w, a) {
  if (status == 0 && g == 0) {
    cm.dispose();
    return;
  }
  if (g == 1) {
    status++;
  } else {
    status--;
  }
  selectionLog[status] = a;
  var v = -1;
  if (status <= v++) {
    cm.dispose();
  } else {
    if (status == v++) {
      cm.askMenu("啊！你也是猎人吧？嗯，我们这儿接到了报告，幽影森林出了不少麻烦啊——钱袋子活过来袭击路人，可怕的幽灵四处出没，甚至还有人看见了一只像是雪怪的生物。为了宽抚大众，我和艾斯拜德决定悬赏打猎这些造成麻烦的生物。完成这些赏金任务，我就任命你当我的副手！有兴趣不？\r\n#b#L0#必须的，我已经等不及想要测试我的战斗能力了！\r\n #l#k", 0, 9201054);
    } else {
      if (status === v++) {
        cm.askMenu("这才像话嘛！不过我得警告你，这是一项艰难的任务——这只怪物不仅难找，而且你找到了也不一定打得过。你确定自己有对付它？\r\n#b#L0#我已经做好准备了，告诉我它是什么怪物吧。\r\n#b#L1#且慢，我还是先找米奇买点药水好了……\r\n#l#k  ", 0, 9201054);
      } else {
        if (status === v++) {
          cm.askMenu("我很欣赏你的勇气，你会需要它们的。这只怪物可是外头最强的怪物之一，它就是——无头骑士！\r\n#b#L0#谁？\r\n#l#k", 0, 9201054);
        } else {
          if (status === v++) {
            cm.askMenu("无头骑士！出没于幽影森林的恶魔！难道你没有听说过他的传说？\r\n#b#L0#没有，你跟我说说。\r\n#l#k", 0, 9201054);
          } else {
            if (status === v++) {
              cm.sendNormalTalk("好吧，那你先坐下，年轻人，我就跟你讲讲这个老故事。是这样的，无头骑士本来并不是怪物，他也曾是人类。", 0, 9201054, false, true);
            } else {
              if (status === v++) {
                cm.askMenu("\r\n#b#L0#真的？那他怎么会变成这样的？\r\n#l#k", 0, 9201054);
              } else {
                if (status === v++) {
                  cm.sendNormalTalk("据我所知，他的名字叫奇利安，曾是守护者的要塞最强大的战士之一。他的战斗风格极为残忍，经常被派去单独执行任务，因为他在暴怒时有时候会不慎伤到战友。他的武器是自一把战矛，同守护者的要塞的许多战士一样，他也掌握了所选择的火元素的用法。据说他能够将怒火集中在他的战矛刺穿敌人，当他极为愤怒时连脑袋都会化作一轮火焰。战斗中碰到这种人一般人早就吓得两脚拌蒜了，尤其是他手上还挥着战矛朝你冲过来，这你想象的出吗？", 0, 9201054, false, true);
                } else {
                  if (status === v++) {
                    cm.sendNormalTalk("对吧。不过虽然他在战斗中非常勇猛，但他在守护者的要塞的日常生活里还是很有自制力的。他爱上了神秘的女术士——勒菲。他们经常花上好几个小时泡在一起聊天。这对情人乍一眼看上去很奇怪，但不知为何，两人相处得非常好。甚至在勒菲离开守护者的要塞后，他也经常会去她克拉奇安森林的住所与她幽会。", 0, 9201054, true, true);
                  } else {
                    if (status === v++) {
                      cm.askMenu("不过，在克拉奇安人同守护者的要塞的战争爆发后，他就没法去看望她了。据说，他的愤怒因此愈演愈烈，最后战士宗师也只能同意让他去看望她。奇利安为了见到她从克拉奇安战士的重重包围中突破出来，却看到了骇人的一幕。\r\n#b#L0#他看到什么了？\r\n#l#k", 0, 9201054);
                    } else {
                      if (status === v++) {
                        cm.sendNormalTalk("她的家着火了，她的马也烧了起来，她本人也被克拉奇安人关进了一个造型古怪的拷问用设备里。一个神秘人，我猜是炼金术师，似乎是身受重伤，也注视着这一切，对勒菲的痛苦显得很是痴迷。奇利安终于忍无可忍，一声怒吼，点燃他的战矛加入了战斗。他如同战神附体，杀得克拉奇安人丢盔弃甲，然后，他向炼金术师冲去。", 0, 9201054, false, true);
                      } else {
                        if (status === v++) {
                          cm.sendNormalTalk("但奇利安不知道的是，炼金术师要比他强大得多。炼金术师一挥手，就将扑向他的奇利安停止在了半空中。尽管失去了不少兵力，炼金术师却似乎并不在意，反倒是对奇利安拥有的这种让他免疫火元素伤害的愤怒兴趣盎然。他提议奇利安协助他的实验，要么就看着他的爱人勒菲活活烧死。奇利安为了拯救他的爱人，接受了炼金术师的提议。他们一起回到了克拉奇安城邦，于是，炼金术师对奇利安做了各种各样可怕的实验。他不仅发现了奇利安愤怒的秘密，还创造出了一支拥有类似能力的克拉奇安战士军团。但炼金术师并不满足……", 0, 9201054, true, true);
                        } else {
                          if (status === v++) {
                            cm.sendNormalTalk("他还需要为这个新的军团任命一位指挥官，显然奇利安是最适合这一职责的？然而，他不愿意背叛他的战友，不愿意与他们兵戎相见，更不愿意将武器对准自己的爱人，自己的家。他面临着一个两难的局面——到底选择哪个？最后，他拒绝了炼金术师的要求，用他剩下的力量，再次将身体裹在火焰之中，让火焰烧掉了自己的脑袋。然而，即便如此他也无法哪个疯狂的炼金术师的阴谋，他找了个老南瓜，将他的炼金术和他逼迫勒菲所下的魔咒结合起来，复活了奇利安的尸体。于是，受愤怒驱使，无所畏惧，冷酷无情的怪物，炼金术师的最高杰作——无头骑士，诞生了。", 0, 9201054, true, true);
                          } else {
                            if (status === v++) {
                              cm.sendNormalTalk("然后，勒菲在被逼透露独创的混乱魔法的秘密后，也失去了利用价值。炼金术师把她变成了一头独特的粉色马，也就是无头骑士的坐骑。大概在炼金术师看来，他这是在让这对爱人能够永远地在一起。然后，他派出他所创造的这些怪物，最终击溃了守护者的要塞。无头骑士这一科学与魔法的结晶，在战斗中几乎无人能敌，消灭了许多英雄。最后，一位名叫拉斐尔的睿智大法师施法让骑士去寻找自己的脑袋，把他引进了幽影森林，总算是摆脱了他。而无头骑士，至今还在那里游荡。", 0, 9201054, true, true);
                            } else if (status === v++) {
                              cm.sendNormalTalk("所以说，你得去找到并干掉这个曾经在一个月内杀害超过10000名战士的怪物。把他那个南瓜头带给我！", 0, 9201054, true, true);
                              cm.forceStartQuest(8236, '');
                              cm.dispose();
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}
function stage0(g, w, a) {
  if (status == 0 && g == 0) {
    cm.dispose();
    return;
  }
  status++;
  selectionLog[status] = a;
  var v = -1;
  if (status <= v++) {
    cm.dispose();
  } else {
    if (status == v++) {
      cm.askYesNo("");
    } else if (status == v++) {
      cm.forceStartQuest();
      cm.dispose();
    }
  }
}
function end(g, w, a) {
  if (status == 0 && g == 0) {
    cm.dispose();
    return;
  }
  if (g == 1) {
    status++;
  } else {
    status--;
  }
  selectionLog[status] = a;
  var v = -1;
  if (status <= v++) {
    cm.dispose();
  } else {
    if (status == v++) {
      cm.sendNormalTalk("太好了！你干掉了#t9400549#还弄来了他的#t4031903#！多亏了你，幽影森林现在更安全了！如果你还想做任务，一定要来找我啊——我这里一直都很缺人手！", 1, 9201054, false, true);
    } else if (status === v++) {
      cm.forceCompleteQuest(8236);
      cm.gainExp(330619);
      cm.sendNormalTalk("请24小时之后再来，到时候我会再找你帮忙的。", 1, 9201054, true, false);
      cm.dispose();
    }
  }
}