var facetype;
var status = -1;
var beauty = -1;
var faceCard = -1;
var types = -1;
function action(S, T, l) {
  if (S == 0) {
    if (status != 1 && beauty != -1) {
      cm.sendOk("你还没做好心理准备吗？决定好了之后，请你再来和我说话。");
    }
    cm.dispose();
    return;
  } else {
    status++;
  }
  if (status == 0) {
    cm.askMenu("你好，我是整形手术领域的艺术家#b#p2012036##k。如果你有#b#t05152053##k，我可以为你做脸部整形手术。怎么样？你想让自己的脸变得完美无瑕吗？\r\n#b#L0#换脸（使用皇家整容优惠券）#l\r\n#b#L1#换脸（使用经典皇家整容优惠券）#l\r\n#b#L2#换脸（RED皇家整容优惠券）#l\r\n#b#L3#换脸（周年庆皇家整容券）#l");
  } else {
    if (status == 1) {
      var z = cm.getPlayerStat("FACE");
      facetype = [];
      if (l == 0) {
        beauty = 0;
        faceCard = 5152053;
        if (cm.getPlayer().getGender() == 0) {
          facetype = [20020, 20021, 20022, 20023, 20024, 20025, 20026, 20027, 20028, 20029, 20030, 20031, 20032, 20033, 20035, 20036, 20037, 20038, 20040, 20043, 20044, 20045, 20046, 20047, 20048, 20049, 20050, 20051, 20052, 20053, 20054, 20055, 20056, 20057, 20058, 20059, 20060, 20061, 20062, 20063, 20064, 20065, 20066, 20067, 20068, 20069, 20070, 20071, 20072, 20074, 20075, 20076, 20077, 20080, 20081, 20082, 20083, 20084, 20085, 20086, 20087, 20088, 20089, 20090, 20093, 20094, 20095, 20096, 20097, 20098, 20099, 23000, 23001, 23002, 23003, 23004, 23005, 23006, 23008, 23010, 23011, 23012, 23013, 23014, 23015, 23016, 23017, 23018, 23019, 23020, 23021, 23023, 23024, 23025, 23028, 23031];
        } else {
          facetype = [21020, 21021, 21022, 21023, 21024, 21025, 21026, 21027, 21028, 21029, 21030, 21031, 21033, 21034, 21035, 21036, 21038, 21041, 21042, 21043, 21044, 21045, 21046, 21047, 21048, 21049, 21050, 21052, 21053, 21054, 21055, 21056, 21057, 21058, 21059, 21060, 21061, 21062, 21063, 21064, 21065, 21066, 21067, 21069, 21070, 21071, 21072, 21073, 21074, 21075, 21077, 21078, 21079, 21080, 21081, 21082, 21083, 21084, 21085, 21086, 21089, 21090, 21091, 21092, 21093, 21094, 21095, 21096, 21097, 21098, 21099, 24001, 24002, 24003, 24004, 24007, 24008, 24009, 24010, 24011, 24012, 24013, 24014, 24015, 24016, 24019, 24020, 24022, 24024, 24026];
        }
      } else {
        if (l == 1) {
          beauty = 1;
          faceCard = 5152093;
          if (cm.getPlayer().getGender() == 0) {
            facetype = [20030, 20033, 20036, 20040, 20047, 20050, 20061, 20062, 20074, 20075, 23017, 23019, 23031];
          } else {
            facetype = [21028, 21033, 21034, 21035, 21038, 21045, 21048, 21069, 21070, 21098, 24015, 24026];
          }
        } else {
          if (l == 2) {
            beauty = 2;
            faceCard = 5152094;
            if (cm.getPlayer().getGender() == 0) {
              facetype = [20037, 20038, 20043, 20071, 20072, 20086, 20098, 23005, 23016, 23021, 23024, 23025];
            } else {
              facetype = [21036, 21041, 21066, 21067, 21079, 21081, 21097, 24012, 24020, 24022];
            }
          } else if (l == 3) {
            beauty = 3;
            faceCard = 5152098;
            if (cm.getPlayer().getGender() == 0) {
              facetype = [20035, 20044, 20046, 23004, 23020, 23028];
            } else {
              facetype = [21031, 21042, 21044, 21099, 24001, 24016, 24024];
            }
          }
        }
      }
      var n = 0;
      var N = [];
      for (var H = 0; H < facetype.length; H++) {
        if (facetype[H] != z - z % 1000 + z % 100) {
          N[n++] = facetype[H] + z % 1000 - z % 100;
        }
      }
      facetype = cm.filterValidFaces(N);
      cm.askMenu("那么你想...\r\n#b#L0#看看这个皇家有什么脸型#l\r\n#b#L1#变换脸型#l");
    } else {
      if (status == 2) {
        if (l == 0) {
          types = 0;
          if (facetype.length == 0) {
            cm.sendOk("出现未知错误。");
          } else {
            cm.askAvatar("那么请随便看看……\r\n#b如果决定要变换了，请点击确定", cm.getNpc(), faceCard, facetype);
          }
        } else if (l == 1) {
          types = 1;
          cm.askYesNo("使用皇家整容院优惠券可以随意更改脸型。但是请别担心，我的手术已经达到了一树的境界。你真的要使用#b#t0" + faceCard + '##k，变换脸型吗？');
        }
      } else {
        if (status == 3) {
          if (types == 0) {
            status = 0;
            action(S, T, beauty);
          } else if (cm.haveItem(faceCard)) {
            cm.setRandomAvatar(faceCard, facetype);
            cm.sendOk("好了，你的朋友们一定认不出你了！");
            cm.dispose();
          } else {
            cm.askYesNo("您没有可使用的会员卡。是否想消耗980抵用券直接使用？");
          }
        } else {
          if (status == 4) {
            if (cm.getPlayer().getCSPoints(1) >= 980) {
              cm.getPlayer().modifyCSPoints(1, -980);
              cm.setRandomAvatar(facetype);
              cm.sendOk("好了，你的朋友们一定认不出你了！");
              cm.dispose();
            } else if (cm.getPlayer().getCSPoints(2) >= 980) {
              cm.getPlayer().modifyCSPoints(2, -980);
              cm.setRandomAvatar(facetype);
              cm.sendOk("好了，你的朋友们一定认不出你了！");
              cm.dispose();
            } else {
              cm.sendOk("你好像没有足够的点卷/抵用卷！");
              cm.dispose();
            }
          }
        }
      }
    }
  }
}
function start() {
  status = -1;
  action(1, 0, 0);
}
;