var status = -1;
var selectionLog = [];
function start() {
  action(1, 0, 0);
}
function action(f, W, U) {
  if (status == 0 && f == 0) {
    cm.dispose();
    return;
  }
  if (f == 1) {
    status++;
  } else {
    status--;
  }
  selectionLog[status] = U;
  var V = -1;
  if (status <= V++) {
    cm.dispose();
  } else {
    if (status === V++) {
      cm.askMenu("虽然我不知道我兄弟是否和你说起过，但是我们俩已经研究守护者的要塞的秘密好多年了。这是冒险岛世界最大的秘密之一……一整片大陆怎么好端端的就消失了呢，尤其是大陆中心还是世界上已知的最大的知识库之一！现在它又出现了，我们会竭尽全力去弄明白的！#l\r\n#b#L0#继续说……#l#k", 0, 9201096);
    } else {
      if (status === V++) {
        cm.askMenu("传说中，守护者的要塞就是用来保护一个带有强大力量的东西。虽然我不知道那东西到底是什么，或者到底曾经做过什么……但是有两点是确凿无疑的：这东西叫#b幻日#k，而且蕴含着难以想象的力量。不管这东西到底是什么，但是那些宗师们正是靠着它，成为了相应领域执牛耳的人物。此外，很少有人知道克拉齐亚是怎么消失的。有传言说克拉齐亚是在经历某些灾难之后沉入了海底，但是我可不这么想……#l\r\n#b#L0#那你是怎么想的？#l#k", 0, 9201096);
      } else {
        if (status === V++) {
          cm.askMenu("要知道，想要让整个大陆都消失，可不是什么容易的事情。你能想象这需要多么强大的力量么？我猜只有像幻日一样强大的东西才能达到这个效果……这种事情肯定不会是巧合，尤其是这么强大的东西就坐落在这片大路上！ #l\r\n#b#L0#的确有可能，但现在说这个有什么用？#l#k", 0, 9201096);
        } else {
          if (status === V++) {
            cm.askMenu("在我被抓走并被关在城堡深处的某个房间中几天之后，里面的士兵带我去了大厅中的某一层。然后，那些石头守卫就把我抓到了 #b城堡的密室#k。#l\r\n#b#L0#密室？#l#k", 0, 9201096);
          } else {
            if (status === V++) {
              cm.askMenu("是啊。进入密室之后，他们带我到了一个大厅中，我觉得那是宗师们曾经开会的议会大厅。我探索城堡的经历和我的想象差的太多了，毕竟我是被某些远古石像很不礼貌地抓在了手中，但不管怎么说，看到那一切都让我觉得如梦似幻。#l\r\n#b#L0#里面到底有什么？#l#k", 0, 9201096);
            } else {
              if (status === V++) {
                cm.askMenu("让我吃惊的是，当我进入议会大厅的时候，我看到里面有#b四名宗师#k！我可没想到 1000 年之后他们居然还活着！他们当时正在激烈地讨论着什么，我好像听到他们提到了幻日！他们在争论的都是，都一直在盯着某种像镜子一样的奇怪装置，拿东西上面还有一系列奇怪的符文在闪烁。 #l\r\n#b#L0#那些是什么符文？#l#k", 0, 9201096);
              } else if (status === V++) {
                cm.askMenu("我觉得那些符文是某种神秘的公报。  当他们意识到我的存在后，一名女性法师挥了挥手，那个装置上的符文就消失了……但是我还是成功地记住了一些！#l\r\n#b#L0#原来是这样。#l#k", 0, 9201096);
                cm.dispose();
              }
            }
          }
        }
      }
    }
  }
}