status = -1;
var itemList = Array(Array(1032032, 500, 1, 0), Array(1032035, 500, 1, 0), Array(1032040, 500, 1, 0), Array(1032041, 500, 1, 0), Array(1032042, 500, 1, 0), Array(1032055, 500, 1, 0), Array(1032056, 500, 1, 0), Array(1032057, 500, 1, 0), Array(1032058, 500, 1, 0), Array(1122001, 500, 1, 0), Array(1122002, 500, 1, 0), Array(1122003, 500, 1, 0), Array(1122004, 500, 1, 0), Array(1122005, 500, 1, 0), Array(1122006, 500, 1, 0), Array(1122015, 500, 1, 0), Array(1122058, 100, 1, 0), Array(1132000, 800, 1, 0), Array(1132001, 700, 1, 0), Array(1132002, 600, 1, 0), Array(1132003, 500, 1, 0), Array(1132004, 450, 1, 0), Array(1132010, 500, 1, 0), Array(1132011, 500, 1, 0), Array(1132012, 500, 1, 0), Array(1132013, 800, 1, 0), Array(1122074, 500, 1, 0), Array(1122075, 500, 1, 0), Array(1002390, 500, 1, 0), Array(1002391, 500, 1, 0), Array(1002392, 500, 1, 0), Array(1002393, 500, 1, 0), Array(1002394, 500, 1, 0), Array(1002395, 500, 1, 0), Array(1002418, 500, 1, 0), Array(1002419, 500, 1, 0), Array(1002424, 500, 1, 0), Array(1002425, 500, 1, 0), Array(1002441, 500, 1, 0), Array(1002508, 500, 1, 0), Array(1002509, 500, 1, 0), Array(1002510, 500, 1, 0), Array(1002511, 500, 1, 0), Array(1002547, 500, 1, 0), Array(1002550, 500, 1, 0), Array(1002551, 500, 1, 0), Array(1002554, 500, 1, 0), Array(1032055, 500, 1, 0), Array(1032056, 500, 1, 0), Array(1032057, 500, 1, 0), Array(1032058, 500, 1, 0), Array(1082145, 100, 1, 1), Array(1082146, 100, 1, 1), Array(1082147, 100, 1, 1), Array(1082148, 100, 1, 1), Array(1082149, 100, 1, 1), Array(1082150, 100, 1, 1), Array(3010013, 150, 1, 0), Array(3010014, 150, 1, 0), Array(3010018, 150, 1, 0), Array(3010019, 150, 1, 0), Array(3010021, 150, 1, 0), Array(3010025, 150, 1, 0), Array(3010028, 150, 1, 0), Array(3010029, 150, 1, 0), Array(3010030, 150, 1, 0), Array(3010031, 150, 1, 0), Array(3010032, 150, 1, 0), Array(3010033, 150, 1, 0), Array(3010037, 150, 1, 0), Array(3010044, 150, 1, 0), Array(3012001, 150, 1, 0), Array(3012002, 150, 1, 0), Array(3010073, 150, 1, 0), Array(3012003, 150, 1, 0), Array(3010012, 150, 1, 0), Array(3010025, 150, 1, 0), Array(3010037, 150, 1, 0), Array(3010038, 150, 1, 0), Array(3010040, 150, 1, 0), Array(3010041, 150, 1, 0), Array(3010043, 150, 1, 0), Array(3010044, 150, 1, 0), Array(3010045, 150, 1, 0), Array(3010046, 150, 1, 0), Array(3010047, 200, 1, 0), Array(3010048, 200, 1, 0), Array(3010049, 200, 1, 0), Array(3010050, 200, 1, 0), Array(3010057, 200, 1, 0), Array(3010058, 200, 1, 0), Array(3010068, 200, 1, 0), Array(3010070, 15, 1, 1), Array(3010071, 125, 1, 0), Array(3010077, 125, 1, 0), Array(3010085, 125, 1, 0), Array(3010096, 125, 1, 0), Array(3010095, 125, 1, 0), Array(3010094, 215, 1, 0), Array(3010098, 125, 1, 0), Array(3010106, 125, 1, 0), Array(3010112, 125, 1, 0), Array(3010117, 125, 1, 0), Array(3010119, 125, 1, 0), Array(3010120, 125, 1, 0), Array(3010123, 125, 1, 0), Array(3010124, 125, 1, 0), Array(3010125, 125, 1, 0), Array(3010127, 125, 1, 0), Array(3012001, 125, 1, 0), Array(3010136, 150, 1, 0), Array(3010155, 300, 1, 0), Array(3010144, 300, 1, 0), Array(3010149, 300, 1, 0), Array(3010129, 300, 1, 0), Array(3010131, 300, 1, 0), Array(3010132, 300, 1, 0), Array(3010133, 300, 1, 0), Array(3010163, 300, 1, 0), Array(1003622, 100, 1, 1), Array(1003621, 200, 1, 1), Array(1003780, 100, 1, 1), Array(1003781, 100, 1, 1), Array(1052526, 100, 1, 1), Array(1052527, 100, 1, 1), Array(1052588, 100, 1, 1), Array(1052589, 100, 1, 1), Array(1212072, 100, 1, 1), Array(1222067, 100, 1, 1), Array(1232064, 100, 1, 1), Array(1242069, 100, 1, 1), Array(1242070, 100, 1, 1), Array(1302070, 100, 1, 1), Array(1312142, 100, 1, 1), Array(1322100, 100, 1, 1), Array(1332214, 100, 1, 1), Array(1342079, 100, 1, 1), Array(1362081, 100, 1, 1), Array(1372168, 100, 1, 1), Array(1382199, 100, 1, 1), Array(1402185, 100, 1, 1), Array(1412126, 100, 1, 1), Array(1422129, 100, 1, 1), Array(1432158, 100, 1, 1), Array(1442209, 100, 1, 1), Array(1452196, 100, 1, 1), Array(1462184, 100, 1, 1), Array(1472205, 100, 1, 1), Array(1482159, 100, 1, 1), Array(1492170, 100, 1, 1), Array(1522085, 100, 1, 1), Array(1532089, 100, 1, 1), Array(3010592, 100, 1, 1), Array(1072743, 50, 1, 1), Array(1082543, 50, 1, 1), Array(1102481, 50, 1, 1), Array(1132174, 50, 1, 1), Array(4033755, 800, 1, 0), Array(2431556, 780, 1, 1), Array(2431561, 750, 1, 1), Array(4033667, 800, 1, 0), Array(1112915, 100, 1, 1));
function action(f, W, U) {
  if (f == 1) {
    status++;
  } else {
    if (status == 0) {
      cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
      cm.dispose();
    }
    status--;
  }
  if (status == 0) {
    if (cm.haveItem(5220040)) {
      cm.askYesNo("冒险岛转蛋机中有各类#b装备、卷轴或稀有新奇的道具#k噢！使用“#b#t5220040##k”就可以交换. 游戏商城中的“其他”－“游戏”区里有噢。假如不买转蛋券的话，是不可以使用我的。现在要玩转蛋机么? ");
    } else {
      cm.sendOk("你背包里有#b#t5220040##k吗?");
      cm.dispose();
    }
  } else {
    if (status == 1) {
      var V = Math.floor(Math.random() * 1000);
      var w = Array();
      for (var N = 0; N < itemList.length; N++) {
        if (itemList[N][1] >= V) {
          w.push(itemList[N]);
        }
      }
      if (w.length != 0) {
        var u = new java.util.Random();
        var Q = u.nextInt(w.length);
        var m = w[Q][0];
        var c = w[Q][2];
        var B = w[Q][3];
        if (cm.haveItem(5220040) && cm.canHold()) {
          if (B == 1) {
            cm.gainGachaponItem(m, c, "战士转蛋机");
          } else {
            cm.gainItem(m, c);
          }
          cm.gainItem(5220040, -1);
          cm.sendOk("你获得了 #b#t" + m + "##k " + c + '个。');
        } else {
          cm.sendOk("你确实有#b#t5220040##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
        }
        cm.dispose();
      } else {
        cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：荣誉勋章 一个。)");
        cm.gainItem(5220040, -1);
        cm.gainItem(2431174, 1);
        cm.dispose();
      }
    } else {
      cm.dispose();
    }
  }
}
var status = -1;
function start() {
  status = -1;
  action(1, 0, 0);
}
;