# id 31504 (Road to Treglow), field 401040000
sm.setSpeakerID(3001100) # Edea
sm.sendNext("你好，你来执行任务啦。")
sm.sendSay("经过考虑，我们决定将#r特雷格罗#k的实验室作为下一个进攻目标。其实#r维克特#k和#r特雷格罗#k的力量并没有多大差距，因为我们掌握了更多#r特雷格罗#k的情报，所以才做出了这个决定。")
sm.sendSay("请你进入#b#m401050000##k，进攻#b#m401052000##k。根据#b#p3001107##k的侦察，通往#b特雷格罗#k那里的路上有许多被化学药品强化的创造物镇守。")
res = sm.sendAskAccept("你就当是探索战吧。请你在#r特雷格罗#k的创造物中，消灭100只#b#p3001107##k侦察发现的#r#o2400118##k，并收集50个它们头顶上的#b#t4000737##k，以便我们对其特点进行研究。\r\n\r\n#r#e（接受时，将自动移至该区域。）")
sm.startQuest(parentID)
sm.setParam(1)
sm.sendNext("啊，在这次的任务中，你只要直接去搜集长颈瓶带回来就行。但在今后的任务中，请通过#b卡塔利安的D-02发报机#k跟我联系。现在你手上没有，我给你吧。")
sm.warp(401052000)
