sm.setSpeakerID(12100)
sm.sendNext("嗯，你的升级进度看起来不错。你已经决定好要选择哪种职业了吗？你可以成为拥有强大力量和高生命值的战士、掌握众多法术的魔法师、在远处射箭的弓箭手、擅长迅捷与隐秘攻击的盗贼，或者使用各种华丽连锁技能的海盗……选择实在太多了！")
choice = sm.sendNext("如果你前往维多利亚岛，只要找到对应的转职教官，就可以转职成你想要的职业。在那之前，先告诉我你对哪种职业感兴趣吧，我会给#b他们#k寄一封推荐信。这样你转职时会更加顺利！那么，你会选择哪个职业呢？\r\n\r\n#b#L0#我想成为强大的战士！#l\r\n#L1#我想成为神秘的魔法师！#l\r\n#L2#我想成为百发百中的弓箭手！#l\r\n#L3#我想成为行动诡秘的盗贼！#l\r\n#L4#我想成为纵横大海的海盗！#l")

sm.createQuestWithQRValue(1406, str(choice+1))
sm.startQuest(parentID)
sm.completeQuest(parentID)

if choice == 0:
    sm.sendNext("战士吗？哈哈，那你一定会变得非常强大！他们不仅能承受大量伤害，也能造成可观的输出。好吧，我会把推荐信送给#b武术教练#k，战士转职教官。")
    sm.sendSay("等你达到 10 级时，他会主动联系你。努力成为一名伟大的战士吧！")
elif choice == 1:
    sm.sendNext("魔法师吗？好的，我会把推荐信送给#b汉斯#k，魔法师转职教官。")
    sm.sendSay("等你达到 10 级时，他们会联系你。努力成为一名伟大的魔法师吧！")
elif choice == 2:
    sm.sendNext("弓箭手吗？好的，我会把推荐信送给#b赫琳娜#k，弓箭手转职教官。")
    sm.sendSay("等你达到 10 级时，她会联系你。努力成为一名伟大的弓箭手吧！")
elif choice == 3:
    sm.sendNext("盗贼吗？好的，我会把推荐信送给#b达克鲁#k，盗贼转职教官。")
    sm.sendSay("等你达到 10 级时，他会联系你。努力成为一名伟大的盗贼吧！")
elif choice == 4:
    sm.sendNext("海盗吗？好的，我会把推荐信送给#b凯琳#k，海盗转职教官。")
    sm.sendSay("等你达到 10 级时，她会联系你。努力成为一名伟大的海盗吧！")