sm.setSpeakerID(1090000)
sm.sendNext("#h0#……？嗯，麦加说的果然没错，你看上去很有天赋。见到你很高兴。我叫凯琳，是海盗船诺特勒斯号的船长，同时也是海盗们的转职官。听说你对海盗感兴趣，是吗？")
sm.sendSay("我们得先谈点个人的事情。为了对抗威胁冒险岛世界的人——黑魔法师，我在不久前组建了海盗团。诺特勒斯号的海盗们现在正在冒险岛世界各地调查黑魔法师的痕迹。")
sm.sendSay("如果你成为海盗的话，就必须帮助调查黑魔法师。当然，这不是义务，而是建议。虽然我是海盗们的转职官，但不是海盗们的主人。所以不是命令，只是建议。")
sm.sendSay("如果你是在冒险岛世界冒险的人，相信你一定愿意为冒险岛世界做这些事情。不是出于奖励，而是出于善意……呵呵。好像扯得太长了。你先记住这些，真正重要的在后面。")
sm.sendSay("海盗大致分为使用短枪的人和使用体术的人，各自的技能存在很大的差别。如果说有什么共同点的话，那就是都有华丽的连续技。虽然操作很难，但熟悉了的话，就会变得很强。")
if sm.sendAskAccept("我好像说得太多了……你快决定吧。到底是成为海盗，还是选择其他职业？如果想成为海盗，我就使用转职官的特权，马上邀请你到诺特勒斯号去。#r拒绝的话，我会建议你选择其他职业。请别担心#k。"):
    sm.warp(120000101)
    sm.startQuest(parentID)
else:
    choice = sm.sendNext("你不想走海盗之路吗？不愿意的话，我就不能勉强。那你就去选择其他道路吧。除了海盗之外，还有四条道路可供选择。\r\n#b#L1#战士#l \r\n#b#L2#魔法师#l \r\n#b#L3#弓箭手#l \r\n#b#L4#飞侠#l")
    if choice == 0:
        sm.sendNext("你想走战士之路吗？虽然很遗憾，但我尊重你的选择。我送你到#b武术教练#k那边吧。（确认后会自动传送到转职地图）")
        sm.createQuestWithQRValue(1406, "1")
        sm.warp(102000003)
    elif choice == 1:
        sm.sendNext("你想走弓箭手之路吗？虽然很遗憾，但我尊重你的选择。我送你到#b汉斯#k那边吧。（确认后会自动传送到转职地图）")
        sm.createQuestWithQRValue(1406, "2")
        sm.warp(101000003)
    elif choice == 2:
        sm.sendNext("你想走弓箭手之路吗？虽然很遗憾，但我尊重你的选择。我送你到#b郝丽娜#k那边吧。（确认后会自动传送到转职地图）")
        sm.createQuestWithQRValue(1406, "3")
        sm.warp(100000201)
    elif choice == 3:
        sm.sendNext("你想走飞侠之路吗？虽然很遗憾，但我尊重你的选择。我送你到#b达克鲁#k那边吧。（确认后会自动传送到转职地图）")
        sm.createQuestWithQRValue(1406, "4")
        sm.warp(103000003)
    sm.chatScript("嗯？还想再考虑一下吗？")
