LIBRARIAN = 2500002

sm.setSpeakerID(LIBRARIAN)
sm.sendNext("你想好关键词了吗? 那就说出你想搜索的词语吧。\r\n\r\n#b#L0# 黑魔法师#l")
sm.sendNext("黑魔法师......黑魔法师的搜索结果包括黑魔法师的封印、黑魔法师的军团长、黑魔法师的登场......等, 大概有3849个标题。")
sm.sendNext("一定是词语太笼统了, 所以需要更具体的关键词。说出你想搜索的词语吧。\r\n\r\n#b#L0# 黑魔法师的复活#l")
sm.sendNext("黑魔法师的复活......噢, 刚好搜出一本书。让我看看......嗯......嗯......这真是, 麻烦了。")
sm.sendNext("看来从市面上无法买到有着相似内容的书籍......我不得不违背约定了。怎么办, 实在是太抱歉了?  你还有其他想好的关键词吗? \r\n\r\n#b#L0# 时间封印#l")
sm.sendNext("时间封印......有一本名为‘禁锢着黑魔法师的时间封印’的书。好吧, 让我看看......嗯, 原来如此。嗯, 那时候原来是那样。那么这个......")
sm.sendNext("好吧, 和这些内容最相近的书叫做#r黑魔法师和五个英雄#k, 你去书店买来就可以了。这两本书基本没什么区别。那么你还有别的词语想要搜索吗? \r\n\r\n#b#L0# ......(附耳低语。)#l")
sm.sendNext("嗯? 你是说......? 啊啊, 莫非是你的名字? 搜索自己名字的事可不常见。也是, 作为人类当然想知道自己走过的轨迹了。那么稍等, 我这就为你搜索......")

sm.setPlayerAsSpeaker()
sm.sendSay("......等等。算了, 请不必搜索了。")

sm.setSpeakerID(LIBRARIAN)
sm.sendSay("嗯? 怎么突然? 哦吼, 莫非你也有什么不想为人所知的秘密? 也是, 有谁会没有秘密呢? 那我就当你没有要搜索的词了。")

sm.setPlayerAsSpeaker()
sm.sendSay("(既然是记录了世间万事, 说不定也有关于我的记录。可是, 事到如今那又有什么用呢? 反正摆在我面前的路只能是往前走。)")
sm.sendSay("(我不会回头看。也许那只会让我更痛苦。)")

sm.completeQuest(parentID)
#sm.jobAdvance(2512)
