var map2 = [321146000, 322016000, 322032000, 323016000, 324023000, 324025000, 324046000, 326045000, 326012000, 326013000, 326046000, 328012000, 328036000];
var map3 = [322036000, 322046000, 323015000, 323035000, 323036000, 324045000, 324024000, 325035000, 325036000, 326016000, 326026000, 327016000, 327046000, 328016000, 328026000];

function start() {
    if (cm.getMap().getNumMonsters() >= 0) {
        var a = cm.getMapId();
        if (map3.indexOf(a) >= 0) {
            cm.warp(a - 2000, 3)
        } else {
            if (map2.indexOf(a) >= 0) {
                cm.warp(a - 2000, 2)
            } else {
                cm.warp(a - 2000, 1)
            }
        }
    } else {
        cm.playerMessage(-1, "必须消灭区域内的所有怪物才能离开。");
        cm.playerMessage(5, "必须消灭区域内的所有怪物才能离开。")
    }
};