var map1 = [321144000, 322013000, 322014000, 322030000, 322031000, 322034000, 322044000, 323013000, 323033000, 324043000, 324022000, 325033000, 326011000, 326010000, 326014000, 326024000, 326040000, 326043000, 326044000, 327014000, 327044000, 328014000, 328010000, 328024000];

function start() {
    if (cm.getMap().getNumMonsters() >= 0) {
        var a = cm.getMapId();
        if (map1.indexOf(a) >= 0) {
            cm.warp(a + 2000, 1)
        } else {
            cm.warp(a + 2000, 2)
        }
    } else {
        cm.playerMessage(-1, "必须消灭区域内的所有怪物才能离开。");
        cm.playerMessage(5, "必须消灭区域内的所有怪物才能离开。")
    }
};